# Connecting to the "Airlines" Database

In [1]:
import os
USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

In [2]:
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)

In [3]:
%load_ext sql

# Tasks

## For the given ticket_no 0005432312164, find: who and where flew.

### A query with subqueries (nested queries)

In [4]:
%%sql $CONNECT_DATA

SELECT 
    (SELECT passenger_name 
     FROM Tickets 
     WHERE ticket_no = '0005432312164') AS passenger_name,
    f.departure_airport,
    f.arrival_airport
FROM 
    Flights f
WHERE 
    f.flight_id IN (
        SELECT tf.flight_id 
        FROM Ticket_Flights tf
        WHERE tf.ticket_no = '0005432312164'
    )

4 rows affected.

[('ALEKSEY GERASIMOV', 'DME', 'EGO'),
 ('ALEKSEY GERASIMOV', 'AAQ', 'EGO'),
 ('ALEKSEY GERASIMOV', 'EGO', 'DME'),
 ('ALEKSEY GERASIMOV', 'EGO', 'AAQ')]

### A query with no subqueries and no joins

In [5]:
%%sql

SELECT 
    t.passenger_name,
    f.departure_airport,
    f.arrival_airport
FROM 
    Tickets t, 
    Ticket_Flights tf, 
    Flights f
WHERE 
    t.ticket_no = '0005432312164'
    AND t.ticket_no = tf.ticket_no
    AND tf.flight_id = f.flight_id;

 * postgresql://reader:***@10.129.0.25/demo
4 rows affected.

[('ALEKSEY GERASIMOV', 'DME', 'EGO'),
 ('ALEKSEY GERASIMOV', 'AAQ', 'EGO'),
 ('ALEKSEY GERASIMOV', 'EGO', 'DME'),
 ('ALEKSEY GERASIMOV', 'EGO', 'AAQ')]

### Self-join option

In [9]:
%%sql

SELECT DISTINC
    t.passenger_name,
    f1.departure_airport,
    f1.arrival_airport
FROM 
    Tickets t, 
    Ticket_Flights tf1, 
    Ticket_Flights tf2, 
    Flights f1, 
    Flights f2
WHERE 
    t.ticket_no = '0005432312164'
    AND t.ticket_no = tf1.ticket_no
    AND t.ticket_no = tf2.ticket_no
    AND tf1.flight_id = f1.flight_id
    AND tf2.flight_id = f2.flight_id
    AND tf1.flight_id != tf2.flight_id

 * postgresql://reader:***@10.129.0.25/demo
12 rows affected.

[('ALEKSEY GERASIMOV', 'DME', 'EGO'),
 ('ALEKSEY GERASIMOV', 'DME', 'EGO'),
 ('ALEKSEY GERASIMOV', 'DME', 'EGO'),
 ('ALEKSEY GERASIMOV', 'AAQ', 'EGO'),
 ('ALEKSEY GERASIMOV', 'AAQ', 'EGO'),
 ('ALEKSEY GERASIMOV', 'AAQ', 'EGO'),
 ('ALEKSEY GERASIMOV', 'EGO', 'DME'),
 ('ALEKSEY GERASIMOV', 'EGO', 'DME'),
 ('ALEKSEY GERASIMOV', 'EGO', 'DME'),
 ('ALEKSEY GERASIMOV', 'EGO', 'AAQ'),
 ('ALEKSEY GERASIMOV', 'EGO', 'AAQ'),
 ('ALEKSEY GERASIMOV', 'EGO', 'AAQ')]

### A query with joins

In [6]:
%%sql

SELECT passenger_name, departure_airport, arrival_airport
FROM Tickets
JOIN Ticket_flights ON Tickets.ticket_no = Ticket_flights.ticket_no
JOIN Flights ON Ticket_flights.flight_id = Flights.flight_id
WHERE Tickets.ticket_no = '0005432312164'

 * postgresql://reader:***@10.129.0.25/demo
4 rows affected.

[('ALEKSEY GERASIMOV', 'DME', 'EGO'),
 ('ALEKSEY GERASIMOV', 'AAQ', 'EGO'),
 ('ALEKSEY GERASIMOV', 'EGO', 'DME'),
 ('ALEKSEY GERASIMOV', 'EGO', 'AAQ')]

## Extend that solution about Mrs. 'ELLA DMITRIEVA' - from where and to where she flew.

In [7]:
%%sql

SELECT departure.city AS from,
       arrival.city AS to
FROM Flights
JOIN Ticket_flights USING (flight_id)
JOIN Tickets USING (ticket_no)
JOIN Airports AS departure ON Flights.departure_airport = departure.airport_code
JOIN Airports AS arrival ON Flights.arrival_airport = arrival.airport_code
WHERE Tickets.passenger_name = 'ELLA DMITRIEVA'

 * postgresql://reader:***@10.129.0.25/demo
7 rows affected.

[('Moscow', 'Yuzhno-Sakhalinsk'),
 ('Moscow', 'Khanty-Mansiysk'),
 ('Khanty-Mansiysk', 'Moscow'),
 ('Moscow', 'Yekaterinburg'),
 ('Yekaterinburg', 'Moscow'),
 ('Yekaterinburg', 'Magnetiogorsk'),
 ('Magnetiogorsk', 'Yekaterinburg')]

## Output a grid: Aircraft model/Total number of seats.

In [8]:
%%sql

SELECT Aircrafts.model AS aircraft_model,
       COUNT(Seats.seat_no) AS seats_number
FROM Aircrafts
JOIN Seats ON Aircrafts.aircraft_code = Seats.aircraft_code
GROUP BY Aircrafts.model
ORDER BY seats_number

 * postgresql://reader:***@10.129.0.25/demo
9 rows affected.

[('Cessna 208 Caravan', 12),
 ('Bombardier CRJ-200', 50),
 ('Sukhoi Superjet-100', 97),
 ('Airbus A319-100', 116),
 ('Boeing 737-300', 130),
 ('Airbus A320-200', 140),
 ('Airbus A321-200', 170),
 ('Boeing 767-300', 222),
 ('Boeing 777-300', 402)]

# Conclusion
- It is easier for me not to use shorthands to understand the query better but they save time in the long run and make the query look more concise
- There were a couple of solutions I tried with the first task, because first I encountered a problem with query expressions returning more than one row